In [ ]:
# データフレームのマージ

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [13]:
dframe1 = DataFrame({'key':['x','z','y','z','x','y'], 'dataset_1':np.arange(6)})

In [14]:
dframe1

  key  dataset_1
0   x          0
1   z          1
2   y          2
3   z          3
4   x          4
5   y          5

In [17]:
dframe2 = DataFrame({'key' : ['q','y','z'], 'data_set_2':[1,2,5]})
dframe2

  key  data_set_2
0   q           1
1   y           2
2   z           5

In [18]:
# データのマージ 何も指定がない場合、同じIndexのkeyをもとにマージを行う
pd.merge(dframe1,dframe2)

  key  dataset_1  data_set_2
0   z          1           5
1   z          3           5
2   y          2           2
3   y          5           2

In [19]:
# マージするKeyの指定
pd.merge(dframe1,dframe2,on='key')

  key  dataset_1  data_set_2
0   z          1           5
1   z          3           5
2   y          2           2
3   y          5           2

In [21]:
# マージ方法の指定は「how」を使用 leftであれば左側のdframe1を基準とする dframe2で指定したければ'right'にすればよい
pd.merge(dframe1,dframe2,on='key', how='left') #dframe1基準

  key  dataset_1  data_set_2
0   x          0         NaN
1   z          1         5.0
2   y          2         2.0
3   z          3         5.0
4   x          4         NaN
5   y          5         2.0

In [22]:
pd.merge(dframe1,dframe2,on='key', how='right') #dframe2基準

  key  dataset_1  data_set_2
0   q        NaN           1
1   y        2.0           2
2   y        5.0           2
3   z        1.0           5
4   z        3.0           5